<template>
  <div class="about main-wrapper">
    <h1>FOUR</h1>
    <br>
    <div class="block-info">
      <h1>План действий</h1>
 

<img src="../assets/img/stack.jpg" alt="" style="width:100%; height:auto;">

    <p>
      <b style="color:red;">vue вакансия </b><br><br>

     <b> Обязанности:</b><br><br>

Изучение предметной области; <br>
Изучение существующего функционала; <br>
Участие в разработке архитектуры и функционала;<br>
Участие в анализе требований и контроле качества продукта.;<br>
Разработка функционала клиентской части на Vue.js .<br><br>

<b>Требования:</b><br>

Опыт работы с Vue.js, Vuex, Vue-router, Axios;<br>
Опыт scss/postcss/stylus/less, flex-вёрстки;<br>
Знания es6, webpack;<br>
Знание Vuetify и TS будет плюсом<br>
    </p>
   
<br> <hr><br><br>
    <p><b style="color:red;">В IT компанию приглашается Front-End Developer (Vue.js).</b> <br><br>
    
    <b> Обязанности:</b> <br><br>
- разработка, тестирование и поддержка проекта на Vue.js; <br>
- разработка модулей к существующим проектам.<br><br>

<b>Требования:</b><br>
- опыт работы с JavaScript или TypeScript;<br>
- уверенное знание HTML, CSS и основных принципов адаптивной верстки;<br>
- понимание базовых принципов работы клиент-серверных web-приложений;<br>
- понимание базовых принципов объектно-ориентированного дизайна программ;<br>
- наличие опыта работы с любым Front-End фреймворком будет плюсом;<br>
- приветствуется понимание принципов Flex-разметки в CSS;<br>
- приветствуется опыт работы с другими языками программирования;<br>
- приветствуется опыт написания модульных и функциональных тестов;<br>
- приветствуется опыт работы с Git;<br>
- приветствуется понимание основных принципов разработки дизайна пользовательских интерфейсов;<br>
- желание активно развиваться и изучать новое;<br>
- умение работать в команде, желание перенимать опыт коллег и делиться собственным опытом;<br>
- терпеливое отношение к чужому коду и к критике собственного;<br>
- умение читать и понимать техническую литературу на английском языке;<br>
- наличие широкого Интернет-канала и настроенной программы Skype, позволяющих поддерживать качественную видеосвязь.<br>
    </p>
    <br><hr><br><br>

    <p style="color:red;"><b>Верстальщик требования </b> <br><br>
    
    

    </p>
    <p><b>Требования:</b><br> <br>

HTML5, CSS3<br>

JavaScript<br>

Базовый PHP<br>

CMS Wordpress<br>

БЭМ<br>

Использование спрайтов<br>

Опыт работы не менее 2 лет. Наличие рабочего портфолио с исходниками!<br>

Соответствие верстки макету - отступы, шрифты, цвета, все должно быть в точности как задумал дизайнер.
( Макеты в photoshop и figma ), попиксельная верстка (допускается погрешность в 3px)<br>

Навыки адаптивной верстки (Знание особенностей верстки под мобильные устройства, планшеты iOS, Android)<br>

Навыки кроссбраузерной верстки<br>

Оперативное реагирование на задачи<br>
    </p>

    <br><hr><br><br>

    <p>
      <b>Требования:</b><br><br>
Практический опыт HTML‚ CSS (умение АДАПТИВНО верстать без бутстрапа). Без наличия данного пункта, кандидатов не рассматриваем!<br>
Уверенный пользователь ПК‚ интернет‚ MS Excel, Word<br>
Уверенные знания программы Photoshop<br>
Грамотная письменная и устная речь<br>
Знание Javascript, Jquery<br>

    </p>

    
    </div>
  </div>
</template>


